var store = [{
        "title": "Настройка nginx на роутере keenetic",
        "excerpt":"Статья описывает установку веб-сервера nginx на роутерах keenetic. Для чего это может быть нужно? Если собственный блог страсть как хочется, публичным хостерам типа github pages вы не доверяете, своей “железной” виртуалки дома у вас нет, а облачному провайдеру платить не хочется, то такой вариант вполне возможен. Помимо установки затрагиваются вопросы...","categories": [],
        "tags": ["nginx","keenetic"],
        "url": "/2024/05/02/nginx_keenetic.html",
        "teaser": null
      },{
        "title": "Выпуск ssl-сертификата на OpenWRT",
        "excerpt":"Статья написана по причине, что настройка Let’s encrypt для выдачи сертификата для сайта имеет несколько особенностей при использовании OpenWRT прошивки и менеджера пакетов opkg, в отличие от стандартнго certbot. Этот достаточно извращенный вариант может понадобиться, если вы решили захостить свой блог на домашнем роутере. В моем случае это Keenetic, белый...","categories": [],
        "tags": ["nginx","ssl"],
        "url": "/2024/07/18/ssl_conf.html",
        "teaser": null
      },{
        "title": "Что есть Jekyll или собственный сайт",
        "excerpt":"После того, как cloud.ru объявил о своем free tier с бесплатной виртуалкой, то хостить веб-сайт на домашнем роутере перестало иметь смысл. В любом случае 2 Ядра/ 4 Гига + возможность подключить такой же халявный S3 сильно лучше крошек памяти на домашнем роутере. Надежность облачного решения будет повыше, а за белый...","categories": [],
        "tags": ["jekyll"],
        "url": "/2024/08/04/jekyll_intro.html",
        "teaser": null
      }]
