var store = [{
        "title": "Настройка nginx на роутере keenetic",
        "excerpt":"Статья описывает установку веб-сервера nginx на роутерах keenetic. Для чего это может быть нужно? Если собственный блог страсть как хочется, публичным хостерам типа github pages вы не доверяете, своей “железной” виртуалки дома у вас нет, а облачному провайдеру платить не хочется, то такой вариант вполне возможен. Помимо установки затрагиваются вопросы...","categories": [],
        "tags": ["nginx","keenetic"],
        "url": "/2024/05/02/nginx_keenetic.html",
        "teaser": null
      },{
        "title": "Выпуск ssl-сертификата на OpenWRT",
        "excerpt":"Статья написана по причине, что настройка Let’s encrypt для выдачи сертификата для сайта имеет несколько особенностей при использовании OpenWRT прошивки и менеджера пакетов opkg, в отличие от стандартнго certbot. Этот достаточно извращенный вариант может понадобиться, если вы решили захостить свой блог на домашнем роутере. В моем случае это Keenetic, белый...","categories": [],
        "tags": ["nginx","ssl"],
        "url": "/2024/07/18/ssl_conf.html",
        "teaser": null
      },{
        "title": "Что есть Jekyll или собственный сайт",
        "excerpt":"После того, как cloud.ru объявил о своем free tier с бесплатной виртуалкой, то хостить веб-сайт на домашнем роутере перестало иметь смысл. В любом случае 2 Ядра/ 4 Гига + возможность подключить такой же халявный S3 сильно лучше крошек памяти на домашнем роутере. Надежность облачного решения будет повыше, а за белый...","categories": [],
        "tags": ["jekyll"],
        "url": "/2024/08/04/jekyll_intro.html",
        "teaser": null
      },{
        "title": "Авторотация ssl-сертификата",
        "excerpt":"Короткая заметка, скорее даже для себя, т.к. постов на эту тему написано немало. Let’s encrypt позволяет выпускать сертификат со сроком жизни не более 3 месяцев. Далее требуется его повторный перевыпуск. Умные и хитрые люди давно автоматизировали этот процесс в виде проекта Certbot. В результате установка и настройка происходит буквально в...","categories": [],
        "tags": ["nginx","ssl"],
        "url": "/2024/12/02/ssl_certbot.html",
        "teaser": null
      },{
        "title": "Запуск Telegram бота на ВМ",
        "excerpt":"И-за того, что Youtube стал блочить запросы к его API из РФ, youtube_transcript_bot сломался. Рабочим вариантом в процессе отладки оказалось банальное использование VPN. После некоторых попыток прикрутить vpn к контейнеру было решено перенести приложение на обычную виртуальную машину (ВМ). Далее, что было сделано. Поставим питон на ВМ sudo dnf update...","categories": [],
        "tags": ["bot","vm"],
        "url": "/2025/02/25/vm_telegram_bot.html",
        "teaser": null
      }]
